// Copyright (c) Parbad. All rights reserved.
// Licensed under the GNU GENERAL PUBLIC License, Version 3.0. See License.txt in the project root for license information.

using System;
using Parbad.Options;

namespace Parbad.Gateway.ENovin.Internal.ResultTranslators;

internal static class ENovinResultTranslator
{
  	public static string Translate(string? result, MessagesOptions options)
	{
		if (result == null || !short.TryParse(result, out var resultAsInt))
		{
			return $"{options.UnexpectedErrorText} Response: {result}";
		}

		return resultAsInt switch
		{
			-138 => "عملیات پرداخت توسط کاربر لغو شد",

			0 => "تراکنش موفق",

			1 => "صادر کننده ی کارت از انجام تراکنش صرف نظر کرد",

			2 => "عملیات تاییدیه این تراکنش قبلا با موفقیت صورت پذیرفته است",

			3 => "پذیرنده ی فروشگاهی نامعتبر می باشد",

			4 => "کارت توسط دستگاه ضبط شود",

			5 => "از انجام تراکنش صرف نظر شد",

			6 => "بروز خطایی ناشناخته",

			7 => "به دلیل شرایط خاص کارت توسط دستگاه ضبط شود",

			8 => "با تشخیص هویت دارنده ی کارت تراکنش موفق می باشد",

			9 => "درخواست رسیده در حال پیگیری و انجام است",

			10 => "تراکنش با مبلغی پایین تر از مبلغ درخواستی پذیرفته شده است",

			11 => "تراکنش با وجود احتمالی برخی مشکلات پذیرفته شده است (به علت جایگاه مشتری VIP)",

			12 => "تراکنش نامعتبر است",

			13 => "مبلغ تراکنش اصلاحیه نادرست است",

			14 => "شماره کارت ارسالی نامعتبر است",

			15 => "صادر کننده ی کارت نامعتبر است",

			16 => "تراکنش مورد تایید است و اطلاعات شیار سوم کارت به روز رسانی شود",

			17 => "مشتری درخواست کننده حذف شده است",

			18 =>
				"در مواقعی که یک تراکنش به هر دلیل پذیرفته نشده است و یا با شرایط خاصی پذیرفته شده است در صورت تایید و یا سماجت مشتری این پیغام را خواهیم داشت",

			19 => "تراکنش مجددا ارسال شود",

			20 => "پاسخ ناشناخته از سمت سوییچ دارندگی",

			21 =>
				"در صورتی که پاسخ به در خواست ترمینال نیازمند هیچ پاسخ خاص یا عملکردی نباشیم این پیام را خواهیم داشت",

			22 => "تراکنش مشکوک به بد عمل کردن (کارت، ترمینال، دارنده کارت) بوده است لذا پذیرفته نشده است",

			23 => "کارمزد ارسالی پذیرنده غیر قابل قبول است",

			24 =>
				"زمانی که یک تراکنش نیازمند عمل کرد یا فراخوانی فایلی خاص باشد و فایل مذکرو در مبدا درخواست موجود نباشد این پیام را خواهیم داشت",

			25 => "تراکنش اصلی یافت نشد",

			26 => "عملیات فایل تکراری",

			27 => "خطا در اصلاح فیلد اطلاعاتی",

			28 => "فایل مورد نظر lock شده است",

			29 => "عملیات فایل ناموفق",

			30 => "قالب پیام دارای اشکال است",

			31 => "بانک پذیرنده توسط سوئیچ پشتیبانی نمی شود",

			32 => "تراکنش به صورت غیر قطعی کامل شده است",

			33 => "تاریخ انقضای کارت سپری شده است کارت توسط دستگاه ضبط شود",

			34 => "تراکنش اصلی با موفقیت انجام نپذیرفته است",

			35 => "بنابر توصیه موسسه یا بانک مدیر کارت به پذیرنده کارت ضبط شده است",

			36 => "کارت محدود شده است کارت توسط دستگاه ضبط شود",

			37 => "پذیرنده در نتیجه چنین درخواستی با بخش امنیتی موسسه یا بانک مدیر کارت تماس گرفته است (یا میگیرد)",

			38 => "تعداد دفعات ورود رمز غلط بیش از حد مجاز است کارت توسط دستگاه ضبط شود",

			39 => "کارت حساب اعتباری ندارد",

			40 => "عملیات درخواستی پشتیبانی نمی گردد",

			41 => "کارت مفقودی میباشد کارت توسط دستگاه ضبط شود",

			42 => "کارت حساب عمومی ندارد",

			43 => "کارت مسروقه میباشد کارت توسط دستگاه ضبط شود",

			44 => "کارت حساب سرمایه گذاری ندارد",

			45 => "قبض قابل پرداخت نمی باشد این قبض قبلا پرداخت شده است",

			51 => "موجودی کافی نمی باشد",

			52 => "کارت حساب جاری ندارد",

			53 => "کارت حساب قرض الحسنه ندارد",

			54 => "تاریخ انقضای کارت سپری شده است",

			55 => "رمز کارت نامعتبر است",

			56 => "کارت نامعتبر است",

			57 => "انجام تراکنش مربوطه توسط دارنده ی کارت مجاز نمی باشد",

			58 => "انجام تراکنش مربوطه توسط پایانه ی انجام دهنده مجاز نمی باشد",

			59 =>
				"به دلیل عدم تطابق اقلام تراکنش با مشخصات رمز پویا از انجام آن جلوگیری شد. با مرکز تماس خدمت دهنده خود تماس بگیرید",

			60 => "بنابر توصیه موسسه یا بانک مدیر کارت به پذیرنده کارت، تراکنش درخواستی پذیرفته نمی شود",

			61 => "مبلغ تراکنش کمتر از حد تعیین شده توسط صادر کننده کارت و یا بیشتر از حد مجاز می باشد",

			62 => "کارت محدود شده است",

			63 => "تمهیدات امنیتی نقض گردیده است",

			64 => "مبلغ تراکنش اصلی نامعتبر است",

			65 => "تعداد درخواست تراکنش بیش از حد مجاز می باشد",

			66 => "در پی تراکنش درخواستی پذیرنده با بخش امنیتی موسسه یا بانک تماس گرفته است",

			67 => "کارت توسط دستگاه ضبط شود",

			68 => "پاسخ لازم برای تکمیل یا انجام تراکنش خیلی دیر رسیده است",

			69 => "تعداد دفعات تکرار رمز از حد مجاز گذشته است",

			75 => "تعداد دفعات ورود رمز غلط بیش از حد مجاز است",

			76 => "مبلغ انتقال داده شده معتبر نیست",

			77 => "روز مالی تراکنش نامعتبر است یا مهلت زمان ارسال اصلاحیه به پایان رسیده است",

			78 => "کارت فعال نیست",

			79 => "حساب متصل به کارت نامعتبر است یا دارای اشکال است",

			80 => "درخواست تراکنش رد شده است",

			81 => "کارت پذیرفته نشد (اختصاصی SLM)",

			82 => "پیام تایید از دستگاه خود پرداز دریافت نشده است (اختصاصی SLM)",

			83 => "سرویس گر سوئیچ کارت تراکنش را نپذیرفته است",

			84 =>
				"در تراکنشهایی که انجام آن مستلزم ارتباط با صادر کننده است در صورت فعال نبودن صادر کننده این پیام در پاسخ ارسال خواهد شد",

			85 => "پردازش گر و یا مبدا انجام تراکنش معتبر نیست",

			86 => "تراکنش درخواستی برای بخش سخت افزاری درخواست شده از آن قابل قبول نیست",

			87 => "سیستم در تبادل کلید رمز دچار مشکل شده است (کد پاسخ اختصاصی SLM)",

			88 => "سیستم در تبادل کلید MAC دچار مشکل شده است (کد پاسخ اختصاصی SLM)",

			89 => "عدم تایید تراکنش توسط سوئیچ خارجی (کد پاسخ اختصاصی SLM)",

			90 => "سامانه مقصد تراکنش در حال انجام عملیات پایان روز می باشد",

			91 => "بانک صادر کننده کارت پاسخگو نمیباشد",

			92 => "مقصد تراکنش پیدا نشد",

			93 => "امکان تکمیل تراکنش وجود ندارد",

			94 => "ارسال تکراری تراکنش بوجود آمده است",

			95 => "در عملیات مغایرت گیری ترمینال اشکال رخ داده است",

			96 => "اشکال در عملکرد سیستم",

			97 => "تراکنش از سوی صادر کننده کارت رد شده است",

			98 => "سقف استفاده از رمز ایستا به پایان رسیده است",

			99 => "خطای صادر کنندگی",

			200 => "سایر خطاهای نگاشت نشده سامانه های بانکی",
				
			_ => $"{options.UnexpectedErrorText} Response: {result}"
		};
	}
}
